Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: ཇི་ལྟར་འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་།
en: How will they practice the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, or the dhāraṇī gateways?

source: ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་ལ་སྤྱོད་པར་འགྱུར། ཇི་ལྟར་དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་།
en: How will they practice the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, or the distinct qualities of the buddhas?

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་ལ་སྤྱོད་པར་འགྱུར། ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་ས་བཅུ་ལ་སྤྱོད་པར་འགྱུར།
en: How will they practice the ten levels of the bodhisattvas?

source: ཇི་ལྟར་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ས་ལས་འདའ་བར་འགྱུར།
en: How will they transcend the levels of the śrāvakas and the pratyekabuddhas?

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མ་མཆིས་པ་ལ་འཇུག་པར་འགྱུར།
en: How will they enter a bodhisattva’s full maturity?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ལ་ནི་གཉིས་སུ་སྤྱོད་པའི་བློ་མེད་དེ།
en: Subhūti,” replied the Blessed One, “bodhisattva great beings do not have any idea of a duality.

source: རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་གཉིས་ཀྱིས། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་མི་སྤྱོད་དོ།
en: Subhūti, it is not with duality that bodhisattva great beings practice the perfection of generosity.

source: །གཉིས་ཀྱིས་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་མི་སྤྱོད་དོ།
en: It is not with duality that they practice the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, or the perfection of wisdom.

source: །གཉིས་ཀྱིས་ནང་སྟོང་པ་ཉིད་ལ་མི་སྤྱོད་དོ།
en: It is not with duality that they practice the emptiness of internal phenomena.

source: །གཉིས་ཀྱིས་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ལ་མི་སྤྱོད་དོ། །གཉིས་ཀྱིས་དྲན་པ་ཉེ་བར་གཞག་པ་དང་། ཡང་དག་པར་སྤོང་བ་དང་།
en: It is not with duality that they practice [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities,.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ལ་མི་སྤྱོད་དོ། །གཉིས་ཀྱིས་འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་།
en: It is not with duality that they practice the applications of mindfulness, the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, or the noble eightfold path.

source: མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་ལ་མི་སྤྱོད་དོ།
en: It is not with duality that they practice the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, or the dhāraṇī gateways.

source: །གཉིས་ཀྱིས་དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་ལ་མི་སྤྱོད་དོ།
en: It is not with duality that they practice the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, or the distinct qualities of the buddhas.

source: །གཉིས་ཀྱིས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ལ་མི་སྤྱོད་དོ། །གསོལ་པ།
en: It is not with duality that they practice [the goals], up to and including all-aspect omniscience.” “

source: བཅོམ་ལྡན་འདས་གལ་ཏེ་དེ་ལྟར་གཉིས་ཀྱིས་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་མི་སྤྱོད། གཉིས་ཀྱིས་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་མི་སྤྱོད། གཉིས་ཀྱིས་སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ལ་མི་སྤྱོད། གཉིས་ཀྱིས་འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་།
en: Blessed Lord, if it is not with duality that they practice the perfection of generosity; practice the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, or the perfection of wisdom; not with duality that they practice any of the aspects of emptiness; not with duality that they practice the thirty-seven factors conducive to enlightenment; not with duality that they practice the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, {Ki.

source: གཟུངས་ཀྱི་སྒོ་ལ་མི་སྤྱོད། གཉིས་ཀྱིས་དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་ལ་མི་སྤྱོད།
en: V: 142} the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, or the dhāraṇī gateways; not with duality that they practice the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, or the distinct qualities of the buddhas; and not with duality that they practice [the goals], up to and including all-aspect omniscience, in that case, how do the roots of virtuous action that those bodhisattva great beings possess increase manifold?

source: གཉིས་ཀྱིས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ལ་མི་སྤྱོད་ན། འོ་ན་དེ་ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དགེ་བའི་རྩ་བ་མང་པོས་རྣམ་པར་འཕེལ་བར་འགྱུར་བས། སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་སྟེ། སེམས་སླད་མ་བསྐྱེད་པའི་བར་དུ་དགེ་བའི་རྩ་བ་མང་པོས་རྣམ་པར་འཕེལ་བར་འགྱུར།
en: Commencing from the time when they first begin to set their mind on enlightenment until their final setting of the mind on enlightenment, how do the roots of virtuous action increase manifold?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་སུ་གང་གཉིས་ལ་སྤྱོད་པ་དེ་དག་ནི་དགེ་བའི་རྩ་བ་རྣམ་པར་འཕེལ་བར་མི་འགྱུར་རོ།
en: Subhūti,” replied the Blessed One, “those who practice in a dualistic manner do not grow the roots of virtuous action.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་བྱིས་པ་སོ་སོའི་སྐྱེ་བོ་ཐམས་ཅད་ནི་གཉིས་ལ་རྟེན་པ་སྟེ། དེ་དག་ནི་དགེ་བའི་རྩ་བས་རྣམ་པར་མི་འཕེལ་ལོ།
en: If you ask why, Subhūti, all ordinary, simple persons depend on duality and they do not grow the roots of virtuous action.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་གཉིས་ལ་མི་སྤྱོད་དེ།
en: Bodhisattva great beings do not practice in a dualistic manner.

source: དེ་ནི་སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་སྟེ། སེམས་ཕྱི་མ་བསྐྱེད་པའི་བར་དུ་དགེ་བའི་རྩ་བས་རྣམ་པར་འཕེལ་ཏེ།
en: Commencing from the time when they first begin to set their mind on enlightenment until their final setting of the mind on enlightenment, their roots of virtuous action do increase.

source: དེ་ནི་ལྷ་དང་། མི་དང་ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་གྱི་མི་དགེ་བའི་རྩ་བ་གང་གིས་ཉམས་སྨད་པས།
en: They will not be debased by any roots of nonvirtuous action that the world with its gods, humans, and asuras may have.

source: ཉན་ཐོས་ཀྱི་ས་འམ། རང་སངས་རྒྱས་ཀྱི་སར་ལྟུང་བར་འགྱུར་བ་འམ། མི་དགེ་བའི་ཆོས་གཞན་གྱིས་ཡོངས་སུ་འཕྲོགས་པར་གྱུར་ཅིང་། དེ་དག་གིས་ཡོངས་སུ་ཕྲོགས་པས།
en: Consequently, they will not fall into the level of the śrāvakas or the level of the pratyekabuddhas, and neither will they be captivated by other nonvirtuous attributes.

source: སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ན། དགེ་བའི་རྩ་བ་མང་པོས་རྣམ་པར་མི་འཕེལ་བ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་།
en: If those who are captivated by such phenomena were to practice the perfection of generosity, their roots of virtuous action would not increase manifold.

source: བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ན། དགེ་བའི་རྩ་བ་མང་པོས་རྣམ་པར་མི་འཕེལ་བ་དང་།
en: If they were to practice the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, or the perfection of wisdom, their roots of virtuous action would not increase manifold.

source: ནང་སྟོང་པ་ཉིད་ལ་སྤྱོད་པ་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ལ་སྤྱོད་ན། དགེ་བའི་རྩ་བ་མང་པོས་རྣམ་པར་མི་འཕེལ་བ་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་དང་། ཡང་དག་པར་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་།
en: If they were to practice the emptiness of internal phenomena and if they were to practice [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, their roots of virtuous action would not increase manifold.

source: དབང་པོ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ལ་སྤྱོད་ན། དགེ་བའི་རྩ་བ་མང་པོས་རྣམ་པར་མི་འཕེལ་བ་དང་། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་།
en: If they were to practice the applications of mindfulness, the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, or the noble eightfold path, their roots of virtuous action would not increase manifold.

source: སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་ལ་སྤྱོད་ན། དགེ་བའི་རྩ་བ་མང་པོས་རྣམ་པར་མི་འཕེལ་བ་དང་།
en: If they were to practice the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, or the dhāraṇī gateways, their roots of virtuous action would not increase manifold.

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་ལ་སྤྱོད་ན། དགེ་བའི་རྩ་བ་མང་པོས་རྣམ་པར་མི་འཕེལ་བ་དང་།
en: If they were to practice the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, or the distinct qualities of the buddhas, their roots of virtuous action would not increase manifold.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ལ་སྤྱོད་ན། དགེ་བའི་རྩ་བ་མང་པོས་རྣམ་པར་མི་འཕེལ་བ་དེ་ལྟར་ཉམས་སྨད་པར་མི་ནུས་ཏེ།
en: If they were to practice [the goals], up to and including all-aspect omniscience, their roots of virtuous action would not increase manifold.

source: རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་དེ་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱད་པར་བྱའོ།
en: Bodhisattva great beings cannot be debased in that manner. Subhūti, so it is that they should practice the perfection of wisdom.” “

source: །གསོལ་པ། བཅོམ་ལྡན་འདས་ཅི་ལགས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་དགེ་བའི་རྩ་བ་རྣམས་ཀྱི་སླད་དུ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པར་བགྱི་འམ།
en: Blessed Lord, should bodhisattva great beings practice the perfection of wisdom for the sake of the roots of virtuous action?” “

source: རབ་འབྱོར་དེ་ནི་མ་ཡིན་ཏེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་དགེ་བའི་རྩ་བ་རྣམས་ཀྱི་ཕྱིར། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་མི་སྤྱོད་དོ།
en: Bodhisattva great beings do not practice the perfection of wisdom for the sake of the roots of virtuous action.

source: །མི་དགེ་བའི་རྩ་བ་རྣམས་ཀྱི་ཕྱིར། ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་མི་སྤྱོད་དེ།
en: Nor indeed do they practice the perfection of wisdom for the sake of the roots of nonvirtuous action.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་བསྙེན་བཀུར་མ་བྱས། དགེ་བའི་རྩ་བ་རྣམས་ཡོངས་སུ་རྫོགས་པར་མ་བྱས། དགེ་བའི་བཤེས་གཉེན་རྣམས་ཀྱིས་ཡོངས་སུ་མ་བཟུང་བར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་མི་ནུས་སོ། །གསོལ་པ།
en: Yet, bodhisattva great beings cannot attain all-aspect omniscience without having revered the lord buddhas, without having perfected the roots of virtuous action, or without having been accepted by spiritual mentors.” “

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་བསྙེན་བཀུར་བགྱིས་པ་དང་། དགེ་བའི་རྩ་བས་ཡོངས་སུ་བཟུང་བ་དང་། དགེ་བའི་གཤེས་གཉེན་གྱིས་ཡོངས་སུ་བཟུང་བའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་འགྱུར་བ་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་སྟེ།
en: Blessed Lord, how do bodhisattva great beings who have revered the lord buddhas, who have been favored by the roots of virtuous action, and who have been accepted by spiritual mentors attain all-aspect omniscience?” {

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་བསྙེན་བཀུར་བྱེད།
en: Ki.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གི་མདོ་དང་དབྱངས་ཀྱིས་བསྙད་པ་དང་། ལུང་བསྟན་པ་དང་། ཚིགས་སུ་བཅད་པ་དང་། ཆེད་དུ་བརྗོད་པ་དང་། གླེང་གཞི་དང་། འདི་ལྟར་འདས་པ་དང་། སྐྱེས་པའི་རབས་དང་། ཤིན་དུ་རྒྱས་པ་དང་། ཆོས་རྨད་དུ་བྱུང་བ་དང་།
en: V: 143} “In this regard, Subhūti,” replied the Blessed One, “commencing from the time when they first begin to set their mind on enlightenment, bodhisattva great beings revere the lord buddhas and acquire all the teachings that they have imparted, including the discourses, the sayings in prose and verse, the prophetic declarations, the verses, the aphorisms, the contexts, the quotations, the tales of past lives, the most extensive teachings, the marvelous events, the narratives, and the established instructions.

source: རྟོགས་པ་བརྗོད་པ་དང་། གཏན་ལ་ཕབ་པ་བསྟན་པ་གང་ཅི་གསུངས་ཀྱང་དེ་དག་ཐམས་ཅད་ཡོངས་སུ་འཛིན་ཏོ། །ཡོངས་སུ་བཟུང་ནས་ཀྱང་ཚིག་གིས་ཡོངས་སུ་འདྲིས་པ་དང་། ཡིད་ཀྱིས་ཤིན་དུ་བརྟགས་པ་དང་། ལྟ་བས་རབ་ཏུ་ཁོང་དུ་ཆུད་པར་བྱས་ཤིང་།
en: Having acquired these, they have also investigated them verbally, examined them intensively through their mental faculties, and comprehended them through their view.

source: གཟུངས་རབ་ཏུ་ཐོབ་པར་བྱེད་དོ། །གཟུངས་རབ་ཏུ་ཐོབ་ནས། སོ་སོ་ཡང་དག་པར་རིག་པ་རབ་ཏུ་སྐྱེད་དོ།
en: They have mastered the dhāraṇīs, and having mastered the dhāraṇīs, they have developed exact knowledge.

source: །སོ་སོ་ཡང་དག་པར་རིག་པ་སྐྱེས་པས། དེ་ཚེ་རྣམ་པར་འཕོས་ཀྱང་། ཆོས་དེ་དག་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་གྱུར་གྱི་བར་དུ་ནམ་ཡང་ཆུད་ཟ་བར་མི་འགྱུར་ཏེ།
en: Those who have developed exact knowledge, having passed away and transmigrated from this life, will never squander those attributes until they have attained all-aspect omniscience.

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་ལ་དགེ་བའི་རྩ་བ་སྐྱེད་ཅིང་། དགེ་བའི་རྩ་བ་དེ་དག་གིས་ཡོངས་སུ་བཟུང་ན། ནམ་ཡང་ངན་སོང་དང་མི་ཁོམ་པར་སྐྱེ་བར་མི་འགྱུར་རོ།
en: If they develop the roots of virtuous action in the presence of those lord buddhas and they are favored with those roots of virtuous action, they will never be reborn in the lower realms or among beings who have no leisure [to practice the Dharma].

source: །དགེ་བའི་རྩ་བ་དེ་དག་གིས་ཀྱང་ལུས་ཡོངས་སུ་དག་པ་ཡོངས་སུ་འཛིན་ཏེ། ལུས་དེ་དག་གིས་ཀྱང་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱེད་དོ།
en: Through these roots of virtuous action, they will acquire a pure physical body, and through these physical bodies they will also refine the buddhafields.

source: །སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱེད་དོ།
en: They will bring beings to maturity.

source: །དགེ་བའི་རྩ་བ་དེ་དག་གིས་ཡོངས་སུ་བཟུང་བས་ཀྱང་། དགེ་བའི་བཤེས་གཉེན་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་དང་། ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་པའི་ལེགས་པ་སྟོན་པ་དག་དང་ནམ་དུ་ཡང་འབྲལ་བར་མི་འགྱུར་རོ།
en: Even after being favored by those roots of virtuous action, they will never be without spiritual mentors, including the lord buddhas, bodhisattva great beings, and the excellent teachers of those who follow the vehicles of the śrāvakas and the pratyekabuddhas.

source: །རབ་འབྱོར་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པས། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་བསྙེན་བཀུར་བར་བྱའོ། །དགེ་བའི་རྩ་བ་རྣམས་བསྐྱེད་པར་བྱའོ། །དགེ་བའི་བཤེས་གཉེན་རྣམས་ལ་བསྟེན་པར་བྱའོ།
en: So it is, Subhūti, that bodhisattva great beings who practice the perfection of wisdom should revere the lord buddhas, they should develop the roots of virtuous action, and they should attend upon spiritual mentors.”

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ་ལས་ལེའུ་ལྔ་བཅུ་ལྔ་པའོ།། །།དེ་ནས་ཚེ་དང་ལྡན་པ་རབ་འབྱོར་གྱིས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་།
en: This completes the fifty-fifth chapter from “The Perfection of Wisdom in Twenty-Five Thousand Lines.”

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་ཡང་བསྙེན་བཀུར་མི་བགྱིད། དགེ་བའི་རྩ་བ་ཡང་ཡོངས་སུ་རྫོགས་པར་མི་བགྱིད་ལ། དགེ་བའི་བཤེས་གཉེན་གྱིས་ཀྱང་ཡོངས་སུ་མ་བཟུང་བར་གྱུར་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་མི་འགྱུར་རམ། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Chapter 56 Then the venerable Subhūti asked the Blessed One, “Blessed Lord, if there are bodhisattva great beings who have not revered the lord buddhas, have not even perfected the roots of virtuous action, and have not even been favored by spiritual mentors, would they not attain all-aspect omniscience?” “

source: རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་གིས། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་བསྙེན་བཀུར་མ་བྱས། དགེ་བའི་རྩ་བ་ཡང་ཡོངས་སུ་རྫོགས་པར་མ་བྱས་ལ། དགེ་བའི་གཤེས་གཉེན་གྱིས་ཡོངས་སུ་མ་བཟུང་བར་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་འགྱུར་བ་མེད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་བསྙེན་བཀུར་ཡང་བྱས། དགེ་བའི་རྩ་བ་ཡང་ཡོངས་སུ་རྫོགས་པར་བྱས། དགེ་བའི་བཤེས་གཉེན་ལ་ཡང་བསྟེན་པ་བྱས་ཀྱང་།
en: Subhūti,” replied the Blessed One, “bodhisattva great beings who have not revered the lord buddhas, have not even perfected the roots of virtuous action, and have not even been favored by spiritual mentors will not attain all-aspect omniscience.

source: ད་དུང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་མི་ནུས་ན། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་བསྙེན་བཀུར་མ་བྱས། དགེ་བའི་རྩ་བ་ཡོངས་སུ་རྫོགས་པར་མ་བྱས། དགེ་བའི་བཤེས་གཉེན་ལ་མ་བསྟེན་པ་རྣམས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་འགྱུར་བ་ལྟ་ཅི་སྨོས་ཏེ།
en: If you ask why, when even those who have revered the lord buddhas, have perfected the roots of virtuous action, and have attended upon spiritual mentors cannot now attain all-aspect omniscience, how could those who have not revered the lord buddhas, have not perfected the roots of virtuous action, and have not been favored by spiritual mentors possibly attain all-aspect omniscience!

source: །རབ་འབྱོར་དེ་ལྟ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བྱང་ཆུབ་སེམས་དཔའི་མིང་བདེན་པ་ལ་གནས་པར་འདོད་པ་དང་། མྱུར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འདོད་པས།
en: Therefore, Subhūti, bodhisattva great beings who wish to maintain authentically the name of a bodhisattva and those who wish to swiftly attain consummate buddhahood in unsurpassed, complete enlightenment {Ki.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་བསྙེན་བཀུར་བྱའོ།
en: V: 144} should revere the lord buddhas.

source: །དགེ་བའི་རྩ་བ་མང་པོ་བསྐྱེད་པར་བྱའོ། །དགེ་བའི་གཤེས་གཉེན་ལ་བསྟེན་པར་བྱའོ། །གསོལ་པ།
en: They should develop manifold roots of virtuous action, and they should attend upon spiritual mentors.” “

source: བཅོམ་ལྡན་འདས་ཅིའི་སླད་དུ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ལ་བསྙེན་བཀུར་བགྱིས། དགེ་བའི་རྩ་བ་བསྐྱེད། དགེ་བའི་བཤེས་གཉེན་ལ་བསྟེན་པར་བགྱིས་ཀྱང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་མི་འགྱུར།
en: Blessed Lord, why do bodhisattva great beings not attain all-aspect omniscience, even though they have revered the lord buddhas, have perfected the roots of virtuous action, and have attended upon spiritual mentors?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དེ་ནི་ཐབས་མཁས་པ་དང་མི་ལྡན་པའི་ཕྱིར་ཏེ།
en: It is because they are without skill in means,” replied the Blessed One. “

source: དེས་སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་ལས་ཐབས་དེ་དག་ཐོབ་པར་མ་གྱུར་པའི་ཕྱིར། དགེ་བའི་རྩ་བ་དེ་ལྟ་བུ་ཡང་མ་བསྐྱེད། གང་དེ་ལ་ཐབས་སྟོན་པའི་དགེ་བའི་བཤེས་གཉེན་དེ་ལྟ་བུ་དག་ལ་ཡང་མ་བསྟེན་པས་དེ་ལྟར་ཐོབ་པར་མི་འགྱུར་རོ།
en: They have not acquired those means from the lord buddhas, nor have they developed such roots of virtuous action, and neither have they attended upon such spiritual mentors who would reveal those means to them.

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐབས་མཁས་པ་གང་དང་ལྡན་པས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཐོབ་པར་འགྱུར་བའི་ཐབས་ལ་མཁས་པ་དེ་གང་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་སྟེ། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ན།
en: Blessed Lord, what is the skill in means that bodhisattva great beings have, through which they would attain all-aspect omniscience?” “

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བས། སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་དང་། རང་སངས་རྒྱས་དང་། ཉན་ཐོས་དང་། མི་དང་མི་མ་ཡིན་པར་གྱུར་པ་རྣམས་ལ་སྦྱིན་པ་ཡོངས་སུ་གཏོང་སྟེ།
en: In this regard, Subhūti,” replied the Blessed One, “when bodhisattva great beings, commencing from the time when they first begin to set their mind on enlightenment, practice the perfection of generosity, while focusing their attention with all-aspect omniscience in mind they dispense gifts to the lord buddhas, the pratyekabuddhas, the śrāvakas, and to humans and nonhumans.

source: དེ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་ཡིད་ལ་བྱ་བ་དེ་དང་ལྡན་པས། སྦྱིན་པ་ལ་ཡང་སྦྱིན་པའི་འདུ་ཤེས་སུ་མི་འགྱུར།
en: That is to say, through focusing their attention with all-aspect omniscience in mind, as far as those gifts are concerned they do not even have the perception of a gift.

source: ལེན་པ་ལ་ཡང་ལེན་པའི་འདུ་ཤེས་སུ་མི་འགྱུར། གཏོང་བ་ལ་ཡང་གཏོང་བའི་འདུ་ཤེས་སུ་མི་འགྱུར་རོ།
en: They have no perception of a recipient, nor do they have any perception of a giver.

source: །དེ་ནི་འདི་ལྟར་ཆོས་ཐམས་ཅད་རང་གི་མཚན་ཉིད་ཀྱིས་སྟོང་པར་ཤེས་ཤིང་། ཆོས་ཐམས་ཅད་མེད་པ་དང་། མ་བྱུང་བ་དང་། ཡོངས་སུ་མ་རྫོགས་པ་དང་། མངོན་པར་མ་གྲུབ་པར་མཐོང་ཞིང་།
en: In this way they know that all phenomena are empty of their own defining characteristics, and they see that all phenomena are nonexistent, unoriginated, unconsummated, and not brought into being.

source: ཆོས་རྣམས་ཀྱིས་མཚན་ཉིད་ལ་འཇུག་ན་ཡང་། ཆོས་ཐམས་ཅད་ནི་ནུས་པ་གང་ཡང་མེད་པའོ། །ཞེས་བྱ་བར་འདུ་བྱེད་མེད་པའི་མཚན་ཉིད་ཀྱིས་འཇུག་སྟེ།
en: Although they penetrate the defining characteristics of all phenomena, they do so through defining characteristics that are unconditioned in that all phenomena are said to be utterly ineffectual.

source: དེ་ཐབས་མཁས་པ་དེ་ལྟ་བུ་དང་ལྡན་པས་ན། དགེ་བའི་རྩ་བས་རྣམ་པར་འཕེལ་བར་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དེ།
en: Since they are endowed with such skill in means, they practice the perfection of generosity while increasing their roots of virtuous action.

source: དེ་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱེད། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱེད་ཀྱང་།
en: Practicing the perfection of generosity, they bring beings to maturity and refine the buddhafields.

source: གཞན་དུ་ན་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་བསྐྱབ་པ་དང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་ཕྱིར། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་མ་གཏོགས་པར་སྦྱིན་པའི་འབྲས་བུ་གང་འཁོར་བར་ཡོངས་སུ་སྤྱད་པར་བྱ་བ་དེ་ལྟ་བུའི་འབྲས་བུ་ལ་སྨོན་པ་མེད་དོ།
en: But other than that, in practicing the perfection of generosity in order that they might protect all beings and bring beings to maturity, they do not aspire for other fruits of their gifts, such that they would enjoy in cyclic existence.”

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ་ལས། ལེའུ་ལྔ་བཅུ་དྲུག་པའོ།། །།
en: This completes the fifty-sixth chapter from “The Perfection of Wisdom in Twenty-Five Thousand Lines.”
